// Exercise #1: Decrease the Student Scores
//สมมุติว่า เราได้เก็บคะแนนสอบของนักเรียนห้องหนึ่งไว้ใน Array scores
let scores = [89, 70, 60, 50, 100, 71];
//วันหนึ่งครูได้ออกมาประกาศว่า มีโจทย์ 1 ข้อที่ครูตรวจพลาดไป ข้อนี้ทุกคนทำผิดแต่ครูดันตรวจเป็นถูก โจทย์ข้อนี้มีคะแนน 10 คะแนน
//ดังนั้นครูจะต้องหักคะแนนของทุกคนออก 10 คะแนน
//ให้เขียนโปรแกรมด้วย For Loop เพื่อทำการหักคะแนนจากนักเรียนทุกคนใน Array scores คนละ 10 คะแนน
//เมื่อโปรแกรมทำงานจะแสดงผลลัพธ์ทางหน้าจอแบบนี้
//[79, 60, 50, 40, 90, 61]

// Start coding here
for(let i = 0; i <= 5; i = i++){
    console.log(scores[i] - 10);
}